<?xml version="1.0" ?>
<net name="saved_model" version="10">
	<layers>
		<layer id="0" name="Func/StatefulPartitionedCall/input/_1/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="30522,128" size="15627264"/>
			<output>
				<port id="0" names="Func/StatefulPartitionedCall/input/_1:0" precision="FP32">
					<dim>30522</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="input_ids" type="Parameter" version="opset1">
			<data element_type="i32" shape="1,128"/>
			<output>
				<port id="0" names="Func/StatefulPartitionedCall/input/_0:0,input_ids:0" precision="I32">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="StatefulPartitionedCall/model_1/bert/embeddings/word_embeddings/embedding_lookup/Cast_27969_const" type="Const" version="opset1">
			<data element_type="i64" offset="15627264" shape="" size="8"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model_1/bert/embeddings/word_embeddings/embedding_lookup/axis:0" precision="I64"/>
			</output>
		</layer>
		<layer id="3" name="StatefulPartitionedCall/model_1/bert/embeddings/word_embeddings/embedding_lookup" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>30522</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="2"/>
			</input>
			<output>
				<port id="3" names="StatefulPartitionedCall/model_1/bert/embeddings/word_embeddings/embedding_lookup/Identity_1:0,StatefulPartitionedCall/model_1/bert/embeddings/word_embeddings/embedding_lookup/Identity:0,StatefulPartitionedCall/model_1/bert/embeddings/word_embeddings/embedding_lookup:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="StatefulPartitionedCall/model_1/bert/embeddings/batch_normalization/batchnorm/mul/EltwiseUnsqueeze3333_const" type="Const" version="opset1">
			<data element_type="f32" offset="15627272" shape="1,1,128" size="512"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model_1/bert/embeddings/batch_normalization/batchnorm/mul:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="StatefulPartitionedCall/model_1/bert/embeddings/batch_normalization/batchnorm/mul_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_1/bert/embeddings/batch_normalization/batchnorm/mul_1:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="StatefulPartitionedCall/model_1/bert/embeddings/batch_normalization/batchnorm/sub/EltwiseUnsqueeze3337_const" type="Const" version="opset1">
			<data element_type="f32" offset="15627784" shape="1,1,128" size="512"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model_1/bert/embeddings/batch_normalization/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="StatefulPartitionedCall/model_1/bert/embeddings/batch_normalization/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_1/bert/embeddings/dropout/Identity:0,StatefulPartitionedCall/model_1/bert/embeddings/batch_normalization/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/query/Tensordot/ReadVariableOp/MinusOne5215_const" type="Const" version="opset1">
			<data element_type="i64" offset="15628296" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/query/Tensordot/MatMul/1_port_transpose5037_const" type="Const" version="opset1">
			<data element_type="f32" offset="15628304" shape="128,128" size="65536"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/query/Tensordot/ReadVariableOp:0" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/query/Tensordot/ReadVariableOp/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/query/Tensordot/ReadVariableOp/Shape/Gather/Cast_17911_const" type="Const" version="opset1">
			<data element_type="i32" offset="15693840" shape="1" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/query/Tensordot/ReadVariableOp/Shape/Gather/Cast_27913_const" type="Const" version="opset1">
			<data element_type="i64" offset="15627264" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="13" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/query/Tensordot/ReadVariableOp/Shape/Gather" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/query/Tensordot/ReadVariableOp/MinusOne/shapes_concat" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/query/Tensordot/Reshape/shape:0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/query/Tensordot/Reshape" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/query/Tensordot/Reshape:0" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/query/Tensordot/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/query/Tensordot/MatMul:0" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/query/Tensordot/Cast_18009_const" type="Const" version="opset1">
			<data element_type="i64" offset="15693844" shape="3" size="24"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/query/Tensordot/shape:0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/query/Tensordot" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/query/Tensordot:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/query/BiasAdd/ReadVariableOp/EltwiseUnsqueeze3349_const" type="Const" version="opset1">
			<data element_type="f32" offset="15693868" shape="1,1,128" size="512"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/query/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/query/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/query/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/Reshape/Cast_17929_const" type="Const" version="opset1">
			<data element_type="i64" offset="15694380" shape="4" size="32"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/Reshape/shape:0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/Reshape" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/Reshape:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/transpose/Cast_17871_const" type="Const" version="opset1">
			<data element_type="i64" offset="15694412" shape="4" size="32"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/transpose/perm:0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/transpose:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/key/Tensordot/ReadVariableOp/MinusOne5227_const" type="Const" version="opset1">
			<data element_type="i64" offset="15628296" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/key/Tensordot/MatMul/1_port_transpose5061_const" type="Const" version="opset1">
			<data element_type="f32" offset="15694444" shape="128,128" size="65536"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/key/Tensordot/ReadVariableOp:0" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/key/Tensordot/ReadVariableOp/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/key/Tensordot/ReadVariableOp/Shape/Gather/Cast_17889_const" type="Const" version="opset1">
			<data element_type="i32" offset="15693840" shape="1" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/key/Tensordot/ReadVariableOp/Shape/Gather/Cast_27891_const" type="Const" version="opset1">
			<data element_type="i64" offset="15627264" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="30" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/key/Tensordot/ReadVariableOp/Shape/Gather" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/key/Tensordot/ReadVariableOp/MinusOne/shapes_concat" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/key/Tensordot/Reshape/shape:0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/key/Tensordot/Reshape" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/key/Tensordot/Reshape:0" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/key/Tensordot/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/key/Tensordot/MatMul:0" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/key/Tensordot/Cast_17873_const" type="Const" version="opset1">
			<data element_type="i64" offset="15693844" shape="3" size="24"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/key/Tensordot/shape:0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/key/Tensordot" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/key/Tensordot:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/key/BiasAdd/ReadVariableOp/EltwiseUnsqueeze3353_const" type="Const" version="opset1">
			<data element_type="f32" offset="15759980" shape="1,1,128" size="512"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/key/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/key/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/key/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/Reshape_1/Cast_17879_const" type="Const" version="opset1">
			<data element_type="i64" offset="15694380" shape="4" size="32"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/Reshape_1/shape:0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/Reshape_1:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/transpose_1/Cast_17907_const" type="Const" version="opset1">
			<data element_type="i64" offset="15694412" shape="4" size="32"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/transpose_1/perm:0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/truediv_copy/const3494_const" type="Const" version="opset1">
			<data element_type="f32" offset="15760492" shape="1,1,1,1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/truediv_copy" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/transpose_1:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/truediv:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/mul_1/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="15760496" shape="1,128,1,128" size="65536"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/mul_1:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/Add:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/Softmax" type="SoftMax" version="opset1">
			<data axis="3"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/dropout_1/Identity:0,StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/Softmax:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/value/Tensordot/ReadVariableOp/MinusOne5263_const" type="Const" version="opset1">
			<data element_type="i64" offset="15628296" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/value/Tensordot/MatMul/1_port_transpose5029_const" type="Const" version="opset1">
			<data element_type="f32" offset="15826032" shape="128,128" size="65536"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/value/Tensordot/ReadVariableOp:0" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/value/Tensordot/ReadVariableOp/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/value/Tensordot/ReadVariableOp/Shape/Gather/Cast_17959_const" type="Const" version="opset1">
			<data element_type="i32" offset="15693840" shape="1" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/value/Tensordot/ReadVariableOp/Shape/Gather/Cast_27961_const" type="Const" version="opset1">
			<data element_type="i64" offset="15627264" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="53" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/value/Tensordot/ReadVariableOp/Shape/Gather" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/value/Tensordot/ReadVariableOp/MinusOne/shapes_concat" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/value/Tensordot/Reshape/shape:0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/value/Tensordot/Reshape" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/value/Tensordot/Reshape:0" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/value/Tensordot/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/value/Tensordot/MatMul:0" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/value/Tensordot/Cast_17877_const" type="Const" version="opset1">
			<data element_type="i64" offset="15693844" shape="3" size="24"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/value/Tensordot/shape:0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/value/Tensordot" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/value/Tensordot:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/value/BiasAdd/ReadVariableOp/EltwiseUnsqueeze3365_const" type="Const" version="opset1">
			<data element_type="f32" offset="15891568" shape="1,1,128" size="512"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/value/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/value/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/value/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/Reshape_2/Cast_18011_const" type="Const" version="opset1">
			<data element_type="i64" offset="15694380" shape="4" size="32"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/Reshape_2/shape:0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/Reshape_2:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/transpose_2/Cast_17931_const" type="Const" version="opset1">
			<data element_type="i64" offset="15694412" shape="4" size="32"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/transpose_2/perm:0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/transpose_2" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/transpose_2:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/MatMul_1" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/MatMul_1:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/transpose_3/Cast_17897_const" type="Const" version="opset1">
			<data element_type="i64" offset="15694412" shape="4" size="32"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/transpose_3/perm:0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/transpose_3" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/Reshape_3:0,StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/self/transpose_3:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/output/dense/Tensordot/ReadVariableOp/MinusOne5179_const" type="Const" version="opset1">
			<data element_type="i64" offset="15628296" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/output/dense/Tensordot/MatMul/1_port_transpose5053_const" type="Const" version="opset1">
			<data element_type="f32" offset="15892080" shape="128,128" size="65536"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/output/dense/Tensordot/ReadVariableOp:0" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/output/dense/Tensordot/ReadVariableOp/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/output/dense/Tensordot/ReadVariableOp/Shape/Gather/Cast_17885_const" type="Const" version="opset1">
			<data element_type="i32" offset="15693840" shape="1" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/output/dense/Tensordot/ReadVariableOp/Shape/Gather/Cast_27887_const" type="Const" version="opset1">
			<data element_type="i64" offset="15627264" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="73" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/output/dense/Tensordot/ReadVariableOp/Shape/Gather" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/output/dense/Tensordot/ReadVariableOp/MinusOne/shapes_concat" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/output/dense/Tensordot/Reshape/shape:0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/output/dense/Tensordot/Reshape" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/output/dense/Tensordot/Reshape:0" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/output/dense/Tensordot/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/output/dense/Tensordot/MatMul:0" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/output/dense/Tensordot/Cast_17901_const" type="Const" version="opset1">
			<data element_type="i64" offset="15693844" shape="3" size="24"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/output/dense/Tensordot/shape:0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/output/dense/Tensordot" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/output/dense/Tensordot:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/output/dense/BiasAdd/ReadVariableOp/EltwiseUnsqueeze3377_const" type="Const" version="opset1">
			<data element_type="f32" offset="15957616" shape="1,1,128" size="512"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/output/dense/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/output/dense/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/output/dropout_2/Identity:0,StatefulPartitionedCall/model_1/bert/encoder/layer_0/attention/output/dense/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/intermediate/Tensordot/ReadVariableOp/MinusOne5299_const" type="Const" version="opset1">
			<data element_type="i64" offset="15628296" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/intermediate/Tensordot/MatMul/1_port_transpose5065_const" type="Const" version="opset1">
			<data element_type="f32" offset="15958128" shape="512,128" size="262144"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/intermediate/Tensordot/ReadVariableOp:0" precision="FP32">
					<dim>512</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/intermediate/Tensordot/ReadVariableOp/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>512</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/intermediate/Tensordot/ReadVariableOp/Shape/Gather/Cast_17979_const" type="Const" version="opset1">
			<data element_type="i32" offset="15693840" shape="1" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/intermediate/Tensordot/ReadVariableOp/Shape/Gather/Cast_27981_const" type="Const" version="opset1">
			<data element_type="i64" offset="15627264" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="86" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/intermediate/Tensordot/ReadVariableOp/Shape/Gather" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/intermediate/Tensordot/ReadVariableOp/MinusOne/shapes_concat" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/intermediate/Tensordot/Reshape/shape:0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/intermediate/Tensordot/Reshape" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/intermediate/Tensordot/Reshape:0" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/intermediate/Tensordot/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/intermediate/Tensordot/MatMul:0" precision="FP32">
					<dim>128</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/intermediate/Tensordot/Cast_17977_const" type="Const" version="opset1">
			<data element_type="i64" offset="16220272" shape="3" size="24"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/intermediate/Tensordot/shape:0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/intermediate/Tensordot" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/intermediate/Tensordot:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/intermediate/BiasAdd/ReadVariableOp/EltwiseUnsqueeze3385_const" type="Const" version="opset1">
			<data element_type="f32" offset="16220296" shape="1,1,512" size="2048"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/intermediate/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/intermediate/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/intermediate/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/intermediate/BiasAdd/GELU_" type="Gelu" version="opset2">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/intermediate/mul_3:0" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/output/dense/Tensordot/ReadVariableOp/MinusOne5239_const" type="Const" version="opset1">
			<data element_type="i64" offset="15628296" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/output/dense/Tensordot/MatMul/1_port_transpose5025_const" type="Const" version="opset1">
			<data element_type="f32" offset="16222344" shape="128,512" size="262144"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/output/dense/Tensordot/ReadVariableOp:0" precision="FP32">
					<dim>128</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/output/dense/Tensordot/ReadVariableOp/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/output/dense/Tensordot/ReadVariableOp/Shape/Gather/Cast_17951_const" type="Const" version="opset1">
			<data element_type="i32" offset="15693840" shape="1" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/output/dense/Tensordot/ReadVariableOp/Shape/Gather/Cast_27953_const" type="Const" version="opset1">
			<data element_type="i64" offset="15627264" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="100" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/output/dense/Tensordot/ReadVariableOp/Shape/Gather" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/output/dense/Tensordot/ReadVariableOp/MinusOne/shapes_concat" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/output/dense/Tensordot/Reshape/shape:0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/output/dense/Tensordot/Reshape" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/output/dense/Tensordot/Reshape:0" precision="FP32">
					<dim>128</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/output/dense/Tensordot/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/output/dense/Tensordot/MatMul:0" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/output/dense/Tensordot/Cast_18005_const" type="Const" version="opset1">
			<data element_type="i64" offset="15693844" shape="3" size="24"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model_1/bert/encoder/layer_0/output/dense/Tensordot/shape:0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="StatefulPartitionedCall/model_1/bert/encoder/layer_0/output/dense/Tensordot" type="Reshape" version="opset1">
