<?xml version="1.0" ?>
<net name="saved_model" version="10">
	<layers>
		<layer id="0" name="Func/StatefulPartitionedCall/input/_71/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="27730,128" size="14197760"/>
			<output>
				<port id="0" names="Func/StatefulPartitionedCall/input/_71:0" precision="FP32">
					<dim>27730</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="input_2" type="Parameter" version="opset1">
			<data element_type="i32" shape="1,55"/>
			<output>
				<port id="0" names="Func/StatefulPartitionedCall/input/_1:0,input_2:0" precision="I32">
					<dim>1</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="StatefulPartitionedCall/model/embedding_1/embedding_lookup/Cast_240198_const" type="Const" version="opset1">
			<data element_type="i64" offset="14197760" shape="" size="8"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/embedding_1/embedding_lookup/axis:0" precision="I64"/>
			</output>
		</layer>
		<layer id="3" name="StatefulPartitionedCall/model/embedding_1/embedding_lookup" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>27730</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>55</dim>
				</port>
				<port id="2"/>
			</input>
			<output>
				<port id="3" names="StatefulPartitionedCall/model/embedding_1/embedding_lookup/Identity_1:0,StatefulPartitionedCall/model/embedding_1/embedding_lookup/Identity:0,StatefulPartitionedCall/model/embedding_1/embedding_lookup:0" precision="FP32">
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Func/StatefulPartitionedCall/input/_72/EltwiseUnsqueeze17218_const" type="Const" version="opset1">
			<data element_type="f32" offset="14197768" shape="1,1,1" size="4"/>
			<output>
				<port id="0" names="Func/StatefulPartitionedCall/input/_72:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="StatefulPartitionedCall/model/tf.math.multiply_5/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/tf.math.multiply_5/Mul:0" precision="FP32">
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="StatefulPartitionedCall/model/tf.strided_slice_1/StridedSlice/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="14197772" shape="1,55,128" size="28160"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/tf.strided_slice_1/StridedSlice:0" precision="FP32">
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="StatefulPartitionedCall/model/tf.__operators__.add_13/AddV2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/dropout_9/Identity:0,StatefulPartitionedCall/model/tf.__operators__.add_13/AddV2:0" precision="FP32">
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="StatefulPartitionedCall/model/dense_34/Tensordot/ReadVariableOp/MinusOne26457_const" type="Const" version="opset1">
			<data element_type="i64" offset="14225932" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="StatefulPartitionedCall/model/dense_34/Tensordot/MatMul/1_port_transpose25918_const" type="Const" version="opset1">
			<data element_type="f32" offset="14225940" shape="128,128" size="65536"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/dense_34/Tensordot/ReadVariableOp:0" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="StatefulPartitionedCall/model/dense_34/Tensordot/ReadVariableOp/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="StatefulPartitionedCall/model/dense_34/Tensordot/ReadVariableOp/Shape/Gather/Cast_140468_const" type="Const" version="opset1">
			<data element_type="i32" offset="14291476" shape="1" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="StatefulPartitionedCall/model/dense_34/Tensordot/ReadVariableOp/Shape/Gather/Cast_240470_const" type="Const" version="opset1">
			<data element_type="i64" offset="14197760" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="13" name="StatefulPartitionedCall/model/dense_34/Tensordot/ReadVariableOp/Shape/Gather" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="StatefulPartitionedCall/model/dense_34/Tensordot/ReadVariableOp/MinusOne/shapes_concat" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/dense_34/Tensordot/Reshape/shape:0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="StatefulPartitionedCall/model/dense_34/Tensordot/Reshape" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/dense_34/Tensordot/Reshape:0" precision="FP32">
					<dim>55</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="StatefulPartitionedCall/model/dense_34/Tensordot/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0">
					<dim>55</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/dense_34/Tensordot/MatMul:0" precision="FP32">
					<dim>55</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="StatefulPartitionedCall/model/dense_34/Tensordot/Cast_140260_const" type="Const" version="opset1">
			<data element_type="i64" offset="14291480" shape="3" size="24"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/dense_34/Tensordot/shape:0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="StatefulPartitionedCall/model/dense_34/Tensordot" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0">
					<dim>55</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/dense_34/Tensordot:0" precision="FP32">
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="StatefulPartitionedCall/model/dense_34/BiasAdd/ReadVariableOp/EltwiseUnsqueeze17550_const" type="Const" version="opset1">
			<data element_type="f32" offset="14291504" shape="1,1,128" size="512"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/dense_34/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="StatefulPartitionedCall/model/dense_34/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/dense_34/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="StatefulPartitionedCall/model/tf.reshape_16/Reshape/Cast_140142_const" type="Const" version="opset1">
			<data element_type="i64" offset="14292016" shape="4" size="32"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/tf.reshape_16/Reshape/shape:0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="StatefulPartitionedCall/model/tf.reshape_16/Reshape" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/tf.reshape_16/Reshape:0" precision="FP32">
					<dim>1</dim>
					<dim>55</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="StatefulPartitionedCall/model/tf.compat.v1.transpose_16/transpose/Cast_140170_const" type="Const" version="opset1">
			<data element_type="i64" offset="14292048" shape="4" size="32"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/tf.compat.v1.transpose_16/transpose/perm:0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="StatefulPartitionedCall/model/tf.compat.v1.transpose_16/transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>55</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/tf.compat.v1.transpose_16/transpose:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="StatefulPartitionedCall/model/dense_35/Tensordot/ReadVariableOp/MinusOne26625_const" type="Const" version="opset1">
			<data element_type="i64" offset="14225932" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="StatefulPartitionedCall/model/dense_35/Tensordot/MatMul/1_port_transpose25934_const" type="Const" version="opset1">
			<data element_type="f32" offset="14292080" shape="128,128" size="65536"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/dense_35/Tensordot/ReadVariableOp:0" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="StatefulPartitionedCall/model/dense_35/Tensordot/ReadVariableOp/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="StatefulPartitionedCall/model/dense_35/Tensordot/ReadVariableOp/Shape/Gather/Cast_140334_const" type="Const" version="opset1">
			<data element_type="i32" offset="14291476" shape="1" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="StatefulPartitionedCall/model/dense_35/Tensordot/ReadVariableOp/Shape/Gather/Cast_240336_const" type="Const" version="opset1">
			<data element_type="i64" offset="14197760" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="30" name="StatefulPartitionedCall/model/dense_35/Tensordot/ReadVariableOp/Shape/Gather" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="StatefulPartitionedCall/model/dense_35/Tensordot/ReadVariableOp/MinusOne/shapes_concat" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/dense_35/Tensordot/Reshape/shape:0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="StatefulPartitionedCall/model/dense_35/Tensordot/Reshape" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/dense_35/Tensordot/Reshape:0" precision="FP32">
					<dim>55</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="StatefulPartitionedCall/model/dense_35/Tensordot/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0">
					<dim>55</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/dense_35/Tensordot/MatMul:0" precision="FP32">
					<dim>55</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="StatefulPartitionedCall/model/dense_35/Tensordot/Cast_140392_const" type="Const" version="opset1">
			<data element_type="i64" offset="14291480" shape="3" size="24"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/dense_35/Tensordot/shape:0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="StatefulPartitionedCall/model/dense_35/Tensordot" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0">
					<dim>55</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/dense_35/Tensordot:0" precision="FP32">
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="StatefulPartitionedCall/model/dense_35/BiasAdd/ReadVariableOp/EltwiseUnsqueeze17614_const" type="Const" version="opset1">
			<data element_type="f32" offset="14357616" shape="1,1,128" size="512"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/dense_35/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="StatefulPartitionedCall/model/dense_35/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/dense_35/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="StatefulPartitionedCall/model/tf.reshape_17/Reshape/Cast_140228_const" type="Const" version="opset1">
			<data element_type="i64" offset="14292016" shape="4" size="32"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/tf.reshape_17/Reshape/shape:0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="StatefulPartitionedCall/model/tf.reshape_17/Reshape" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/tf.reshape_17/Reshape:0" precision="FP32">
					<dim>1</dim>
					<dim>55</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="StatefulPartitionedCall/model/tf.compat.v1.transpose_17/transpose/Cast_140314_const" type="Const" version="opset1">
			<data element_type="i64" offset="14292048" shape="4" size="32"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/tf.compat.v1.transpose_17/transpose/perm:0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="StatefulPartitionedCall/model/tf.compat.v1.transpose_17/transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>55</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="StatefulPartitionedCall/model/tf.math.truediv_4/truediv_copy/const18198_const" type="Const" version="opset1">
			<data element_type="f32" offset="14358128" shape="1,1,1,1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="StatefulPartitionedCall/model/tf.math.truediv_4/truediv_copy" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/tf.compat.v1.transpose_17/transpose:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="StatefulPartitionedCall/model/tf.linalg.matmul_8/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/tf.math.truediv_4/truediv:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="StatefulPartitionedCall/model/tf.math.equal_2/Equal/y/EltwiseUnsqueeze17222_const" type="Const" version="opset1">
			<data element_type="i32" offset="14358132" shape="1,1" size="4"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/tf.math.equal_2/Equal/y:0" precision="I32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="StatefulPartitionedCall/model/tf.math.equal_2/Equal" type="Equal" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>55</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/tf.math.equal_2/Equal:0" precision="BOOL">
					<dim>1</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="StatefulPartitionedCall/model/tf.cast_2/Cast" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>55</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model/tf.cast_2/Cast:0" precision="FP32">
					<dim>1</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="StatefulPartitionedCall/model/tf.__operators__.getitem_3/strided_slice/Cast_140376_const" type="Const" version="opset1">
			<data element_type="i64" offset="14358136" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="StatefulPartitionedCall/model/tf.__operators__.getitem_3/strided_slice/Cast_240378_const" type="Const" version="opset1">
			<data element_type="i64" offset="14358136" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="StatefulPartitionedCall/model/tf.__operators__.getitem_3/strided_slice/Cast_340380_const" type="Const" version="opset1">
			<data element_type="i64" offset="14358168" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="StatefulPartitionedCall/model/tf.__operators__.getitem_3/strided_slice" type="StridedSlice" version="opset1">
			<data begin_mask="1,1,0,0" ellipsis_mask="0,0,0,0" end_mask="1,1,0,0" new_axis_mask="0,0,1,1" shrink_axis_mask="0,0,0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>55</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
				<port id="2">
					<dim>4</dim>
				</port>
				<port id="3">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" names="StatefulPartitionedCall/model/tf.__operators__.getitem_3/strided_slice:0" precision="FP32">
					<dim>1</dim>
					<dim>55</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="StatefulPartitionedCall/model/tf.expand_dims/ExpandDims/EltwiseUnsqueeze17226_const" type="Const" version="opset1">
			<data element_type="f32" offset="14358200" shape="1,55,1,55" size="12100"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/tf.expand_dims/ExpandDims:0" precision="FP32">
					<dim>1</dim>
					<dim>55</dim>
					<dim>1</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="StatefulPartitionedCall/model/tf.math.maximum/Maximum" type="Maximum" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>55</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>55</dim>
					<dim>1</dim>
					<dim>55</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/tf.math.maximum/Maximum:0" precision="FP32">
					<dim>1</dim>
					<dim>55</dim>
					<dim>1</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="StatefulPartitionedCall/model/tf.math.multiply_6/Mul/y/EltwiseUnsqueeze17230_const" type="Const" version="opset1">
			<data element_type="f32" offset="14370300" shape="1,1,1,1" size="4"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/tf.math.multiply_6/Mul/y:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="StatefulPartitionedCall/model/tf.math.multiply_6/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>55</dim>
					<dim>1</dim>
					<dim>55</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/tf.math.multiply_6/Mul:0" precision="FP32">
					<dim>1</dim>
					<dim>55</dim>
					<dim>1</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="StatefulPartitionedCall/model/tf.__operators__.add_14/AddV2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>55</dim>
					<dim>1</dim>
					<dim>55</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/tf.__operators__.add_14/AddV2:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="StatefulPartitionedCall/model/tf.nn.softmax_4/Softmax" type="SoftMax" version="opset1">
			<data axis="3"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</input>
			<output>
				<port id="1" names="StatefulPartitionedCall/model/tf.nn.softmax_4/Softmax:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="StatefulPartitionedCall/model/dense_36/Tensordot/ReadVariableOp/MinusOne26733_const" type="Const" version="opset1">
			<data element_type="i64" offset="14225932" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="StatefulPartitionedCall/model/dense_36/Tensordot/MatMul/1_port_transpose25746_const" type="Const" version="opset1">
			<data element_type="f32" offset="14370304" shape="128,128" size="65536"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/dense_36/Tensordot/ReadVariableOp:0" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="StatefulPartitionedCall/model/dense_36/Tensordot/ReadVariableOp/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="StatefulPartitionedCall/model/dense_36/Tensordot/ReadVariableOp/Shape/Gather/Cast_140114_const" type="Const" version="opset1">
			<data element_type="i32" offset="14291476" shape="1" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="StatefulPartitionedCall/model/dense_36/Tensordot/ReadVariableOp/Shape/Gather/Cast_240116_const" type="Const" version="opset1">
			<data element_type="i64" offset="14197760" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="63" name="StatefulPartitionedCall/model/dense_36/Tensordot/ReadVariableOp/Shape/Gather" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="StatefulPartitionedCall/model/dense_36/Tensordot/ReadVariableOp/MinusOne/shapes_concat" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/dense_36/Tensordot/Reshape/shape:0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="StatefulPartitionedCall/model/dense_36/Tensordot/Reshape" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/dense_36/Tensordot/Reshape:0" precision="FP32">
					<dim>55</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="StatefulPartitionedCall/model/dense_36/Tensordot/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0">
					<dim>55</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/dense_36/Tensordot/MatMul:0" precision="FP32">
					<dim>55</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="StatefulPartitionedCall/model/dense_36/Tensordot/Cast_140136_const" type="Const" version="opset1">
			<data element_type="i64" offset="14291480" shape="3" size="24"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/dense_36/Tensordot/shape:0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="StatefulPartitionedCall/model/dense_36/Tensordot" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0">
					<dim>55</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/dense_36/Tensordot:0" precision="FP32">
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="StatefulPartitionedCall/model/dense_36/BiasAdd/ReadVariableOp/EltwiseUnsqueeze17538_const" type="Const" version="opset1">
			<data element_type="f32" offset="14435840" shape="1,1,128" size="512"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/dense_36/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="StatefulPartitionedCall/model/dense_36/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/dense_36/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="StatefulPartitionedCall/model/tf.reshape_18/Reshape/Cast_140602_const" type="Const" version="opset1">
			<data element_type="i64" offset="14292016" shape="4" size="32"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/tf.reshape_18/Reshape/shape:0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="StatefulPartitionedCall/model/tf.reshape_18/Reshape" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/tf.reshape_18/Reshape:0" precision="FP32">
					<dim>1</dim>
					<dim>55</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="StatefulPartitionedCall/model/tf.compat.v1.transpose_18/transpose/Cast_140230_const" type="Const" version="opset1">
			<data element_type="i64" offset="14292048" shape="4" size="32"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/tf.compat.v1.transpose_18/transpose/perm:0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="StatefulPartitionedCall/model/tf.compat.v1.transpose_18/transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>55</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/tf.compat.v1.transpose_18/transpose:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="StatefulPartitionedCall/model/tf.linalg.matmul_9/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>55</dim>
					<dim>55</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/tf.linalg.matmul_9/MatMul:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="StatefulPartitionedCall/model/tf.compat.v1.transpose_19/transpose/Cast_140474_const" type="Const" version="opset1">
			<data element_type="i64" offset="14292048" shape="4" size="32"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/tf.compat.v1.transpose_19/transpose/perm:0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="StatefulPartitionedCall/model/tf.compat.v1.transpose_19/transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/tf.reshape_19/Reshape:0,StatefulPartitionedCall/model/tf.compat.v1.transpose_19/transpose:0" precision="FP32">
					<dim>1</dim>
					<dim>55</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="StatefulPartitionedCall/model/dense_37/Tensordot/ReadVariableOp/MinusOne26817_const" type="Const" version="opset1">
			<data element_type="i64" offset="14225932" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="StatefulPartitionedCall/model/dense_37/Tensordot/MatMul/1_port_transpose25714_const" type="Const" version="opset1">
			<data element_type="f32" offset="14436352" shape="128,128" size="65536"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/dense_37/Tensordot/ReadVariableOp:0" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="StatefulPartitionedCall/model/dense_37/Tensordot/ReadVariableOp/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="StatefulPartitionedCall/model/dense_37/Tensordot/ReadVariableOp/Shape/Gather/Cast_140726_const" type="Const" version="opset1">
			<data element_type="i32" offset="14291476" shape="1" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="StatefulPartitionedCall/model/dense_37/Tensordot/ReadVariableOp/Shape/Gather/Cast_240728_const" type="Const" version="opset1">
			<data element_type="i64" offset="14197760" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="83" name="StatefulPartitionedCall/model/dense_37/Tensordot/ReadVariableOp/Shape/Gather" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="StatefulPartitionedCall/model/dense_37/Tensordot/ReadVariableOp/MinusOne/shapes_concat" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/dense_37/Tensordot/Reshape/shape:0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="StatefulPartitionedCall/model/dense_37/Tensordot/Reshape" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>55</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/dense_37/Tensordot/Reshape:0" precision="FP32">
					<dim>55</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="StatefulPartitionedCall/model/dense_37/Tensordot/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0">
					<dim>55</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/dense_37/Tensordot/MatMul:0" precision="FP32">
					<dim>55</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="StatefulPartitionedCall/model/dense_37/Tensordot/Cast_140414_const" type="Const" version="opset1">
			<data element_type="i64" offset="14291480" shape="3" size="24"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/dense_37/Tensordot/shape:0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="StatefulPartitionedCall/model/dense_37/Tensordot" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0">
					<dim>55</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/dense_37/Tensordot:0" precision="FP32">
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="StatefulPartitionedCall/model/dense_37/BiasAdd/ReadVariableOp/EltwiseUnsqueeze17574_const" type="Const" version="opset1">
			<data element_type="f32" offset="14501888" shape="1,1,128" size="512"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/dense_37/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="StatefulPartitionedCall/model/dense_37/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/dropout_10/Identity:0,StatefulPartitionedCall/model/dense_37/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="StatefulPartitionedCall/model/tf.__operators__.add_15/AddV2" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/tf.__operators__.add_15/AddV2:0" precision="FP32">
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="StatefulPartitionedCall/model/batch_normalization_8/batchnorm/mul/EltwiseUnsqueeze17234_const" type="Const" version="opset1">
			<data element_type="f32" offset="14502400" shape="1,1,128" size="512"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/batch_normalization_8/batchnorm/mul:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="StatefulPartitionedCall/model/batch_normalization_8/batchnorm/mul_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/batch_normalization_8/batchnorm/mul_1:0" precision="FP32">
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="StatefulPartitionedCall/model/batch_normalization_8/batchnorm/sub/EltwiseUnsqueeze17238_const" type="Const" version="opset1">
			<data element_type="f32" offset="14502912" shape="1,1,128" size="512"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/batch_normalization_8/batchnorm/sub:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="StatefulPartitionedCall/model/batch_normalization_8/batchnorm/add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/batch_normalization_8/batchnorm/add_1:0" precision="FP32">
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="StatefulPartitionedCall/model/dense_40/Tensordot/ReadVariableOp/MinusOne26637_const" type="Const" version="opset1">
			<data element_type="i64" offset="14225932" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="StatefulPartitionedCall/model/dense_40/Tensordot/MatMul/1_port_transpose25902_const" type="Const" version="opset1">
			<data element_type="f32" offset="14503424" shape="128,128" size="65536"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/dense_40/Tensordot/ReadVariableOp:0" precision="FP32">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="StatefulPartitionedCall/model/dense_40/Tensordot/ReadVariableOp/Shape" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="StatefulPartitionedCall/model/dense_40/Tensordot/ReadVariableOp/Shape/Gather/Cast_140426_const" type="Const" version="opset1">
			<data element_type="i32" offset="14291476" shape="1" size="4"/>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="StatefulPartitionedCall/model/dense_40/Tensordot/ReadVariableOp/Shape/Gather/Cast_240428_const" type="Const" version="opset1">
			<data element_type="i64" offset="14197760" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="101" name="StatefulPartitionedCall/model/dense_40/Tensordot/ReadVariableOp/Shape/Gather" type="Gather" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="StatefulPartitionedCall/model/dense_40/Tensordot/ReadVariableOp/MinusOne/shapes_concat" type="Concat" version="opset1">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/dense_40/Tensordot/Reshape/shape:0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="StatefulPartitionedCall/model/dense_40/Tensordot/Reshape" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/dense_40/Tensordot/Reshape:0" precision="FP32">
					<dim>55</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="StatefulPartitionedCall/model/dense_40/Tensordot/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true"/>
			<input>
				<port id="0">
					<dim>55</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/dense_40/Tensordot/MatMul:0" precision="FP32">
					<dim>55</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="StatefulPartitionedCall/model/dense_40/Tensordot/Cast_140618_const" type="Const" version="opset1">
			<data element_type="i64" offset="14291480" shape="3" size="24"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/dense_40/Tensordot/shape:0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="StatefulPartitionedCall/model/dense_40/Tensordot" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0">
					<dim>55</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/dense_40/Tensordot:0" precision="FP32">
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="StatefulPartitionedCall/model/dense_40/BiasAdd/ReadVariableOp/EltwiseUnsqueeze17470_const" type="Const" version="opset1">
			<data element_type="f32" offset="14568960" shape="1,1,128" size="512"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/dense_40/BiasAdd/ReadVariableOp:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="StatefulPartitionedCall/model/dense_40/BiasAdd/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/dense_40/BiasAdd:0" precision="FP32">
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="StatefulPartitionedCall/model/tf.reshape_20/Reshape/Cast_140070_const" type="Const" version="opset1">
			<data element_type="i64" offset="14292016" shape="4" size="32"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/tf.reshape_20/Reshape/shape:0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="StatefulPartitionedCall/model/tf.reshape_20/Reshape" type="Reshape" version="opset1">
			<data special_zero="false"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/tf.reshape_20/Reshape:0" precision="FP32">
					<dim>1</dim>
					<dim>55</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="StatefulPartitionedCall/model/tf.compat.v1.transpose_20/transpose/Cast_140718_const" type="Const" version="opset1">
			<data element_type="i64" offset="14292048" shape="4" size="32"/>
			<output>
				<port id="0" names="StatefulPartitionedCall/model/tf.compat.v1.transpose_20/transpose/perm:0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="StatefulPartitionedCall/model/tf.compat.v1.transpose_20/transpose" type="Transpose" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>55</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="StatefulPartitionedCall/model/tf.compat.v1.transpose_20/transpose:0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>55</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Func/StatefulPartitionedCall/input/_4/Output_0/Data__const" type="Const" version="opset1">
			<data element_type="f32" offset="14569472" shape="14214,128" size="7277568"/>
			<output>
				<port id="0" names="Func/StatefulPartitionedCall/input/_4:0" precision="FP32">
					<dim>14214</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="input_1" type="Parameter" version="opset1">
			<data element_type="i32" shape="1,49"/>
			<output>
				<port id="0" names="Func/StatefulPartitionedCall/input/_0:0,input_1:0" precision="I32">
					<dim>1</dim>
					<dim>49</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="StatefulPartitionedCall/model/embedding/embedding_lookup/Cast_240128_const" type="Const" version="opset1">
